{
    "id": "1.4",
    "title": "Ensure no 'root' user account access key exists",
    "profile": "Level 1",
    "description": "The 'root' user account is the most privileged user in an AWS account. AWS Access Keys provide programmatic access to a given AWS account. It is recommended that all access keys associated with the 'root' user account be deleted.",
    "rationale": "Deleting access keys associated with the 'root' user account limits vectors by which the account can be compromised. Additionally, deleting the 'root' access keys encourages the creation and use of role based accounts that are least privileged.",
    "remediation_type": "Automated",
    "audit": "Perform the following to determine if the 'root' user account has access keys:\nFrom Console:\n1. Login to the AWS Management Console.\n2. Click Services.\n3. Click IAM.\n4. Click on Credential Report.\n5. This will download a .csv file which contains credential usage for all IAM users within an AWS Account - open this file.\n6. For the <root_account> user, ensure the access_key_1_active and access_key_2_active fields are set to FALSE.\nFrom Command Line:\nRun the following command:\naws iam get-account-summary | grep \"AccountAccessKeysPresent\"\nIf no 'root' access keys exist the output will show \"AccountAccessKeysPresent\": 0,.\nIf the output shows a \"1\", then 'root' keys exist and should be deleted.",
    "remediation": "Perform the following to delete active 'root' user access keys.\nFrom Console:\n1. Sign in to the AWS Management Console as 'root' and open the IAM console at https://console.aws.amazon.com/iam/.\n2. Click on <root_account> at the top right and select My Security Credentials from the drop down list.\n3. On the pop out screen Click on Continue to Security Credentials.\n4. Click on Access Keys (Access Key ID and Secret Access Key).\n5. Under the Status column (if there are any Keys which are active).\n6. Click Delete (Note: Deleted keys cannot be recovered).\nNote: While a key can be made inactive, this inactive key will still show up in the CLI command from the audit procedure, and may lead to a key being falsely flagged as being non-compliant.",
    "impact": "",
    "default_value": "",
    "references": [
      "http://docs.aws.amazon.com/general/latest/gr/aws-access-keys-best-practices.html",
      "http://docs.aws.amazon.com/general/latest/gr/managing-aws-access-keys.html",
      "http://docs.aws.amazon.com/IAM/latest/APIReference/API_GetAccountSummary.html",
      "https://aws.amazon.com/blogs/security/an-easier-way-to-determine-the-presence-of-aws-account-access-keys/"
    ],
    "cis_controls_v8": [
      {
        "id": "3.3",
        "name": "Configure Data Access Control Lists",
        "description": "Configure data access control lists based on a user's need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications.",
        "asset_type": "Data",
        "security_function": "Protect",
        "implementation_groups": [
          1,
          2,
          3
        ],
        "applicability_of_service_model": {
          "IaaS": true,
          "PaaS": true,
          "SaaS": true,
          "FaaS": true
        }
      },
      {
        "id": "5.4",
        "name": "Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "description": "Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user's primary, non-privileged account.",
        "asset_type": "Users",
        "security_function": "Protect",
        "implementation_groups": [
          1,
          2,
          3
        ],
        "applicability_of_service_model": {
          "IaaS": true,
          "PaaS": true,
          "SaaS": true,
          "FaaS": true
        }
      }
    ],
    "additional_information": "IAM User account \"root\" for us-gov cloud regions is not enabled by default. However, on request to AWS support enables 'root' access only through access-keys (CLI, API methods) for us-gov cloud region."
  }